base/Documents/бит_му_КонсолидационныеКорректировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_КонсолидационныеКорректировки</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Периметр</Name>
					<Comment>Периметр</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_му_ПериметрыКонсолидации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетВспомогательный</Name>
					<Comment>Счет вспомогательный</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Comment>Регистр бухгалтерии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Comment>Дата начала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетГудвилла</Name>
					<Comment>Счет Гудвилла</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписанияОбесцененияГудвилла</Name>
					<Comment>Счет списания обесценения Гудвилла</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколЗаполнения</Name>
					<Comment>Протокол заполнения</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСчетНПР</Name>
					<Comment>Основной счет НПР</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНПРИтого</Name>
					<Comment>Сумма НПР итого</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Гудвилл</Name>
					<Comment>Гудвилл</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Comment>Организация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаДатуПриобретения</Name>
							<Comment>На дату приобретения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаДатуНачала</Name>
							<Comment>На дату начала</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаДатуОкончания</Name>
							<Comment>На дату окончания</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокСчетовНРП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Comment>Счет</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставНРП</Name>
					<Comment>Состав НРП</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СоставляющаяНРП</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_СоставляющиеНРП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Comment>Организация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокСчетовАкционерногоКапитала</Name>
					<Comment>Список счетов акционерного капитала</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Comment>Счет</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокСчетовЭмиссионногоДохода</Name>
					<Comment>Список счетов эмиссионного дохода</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Comment>Счет</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Капитал</Name>
					<Comment>Капитал</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Comment>Организация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставляющаяКапитала</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_СоставляющиеКапитала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Comment>Счет</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Documents/бит_му_КонсолидационныеКорректировки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ПервоначальноеЗаполнениеДокумента();
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	ПервоначальноеЗаполнениеДокумента(ОбъектКопирования);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	
		
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	

	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки.
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка, Отказ, Заголовок, ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	СтруктураТаблиц 		= ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента);	
	
	// Получим курсы валют, неоходимые для выполнения пересчетов.
	ВидыКурсов = Новый Структура("Упр,Регл,МУ");
	СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, СтруктураШапкиДокумента.Дата, ВидыКурсов);
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция готовит таблицы документа для проведения.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
// 
// Возвращаемое значение:
//  СтруктураТаблиц - Структура.
// 
Функция ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента) Экспорт
	
	СтруктураТаблиц = Новый Структура;
	
	// Табличная часть "Гудвилл"
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_му_КонсолидационныеКорректировкиГудвилл.Организация,
	               |	бит_му_КонсолидационныеКорректировкиГудвилл.НаДатуПриобретения,
	               |	бит_му_КонсолидационныеКорректировкиГудвилл.НаДатуНачала,
	               |	бит_му_КонсолидационныеКорректировкиГудвилл.НаДатуОкончания
	               |ИЗ
	               |	Документ.бит_му_КонсолидационныеКорректировки.Гудвилл КАК бит_му_КонсолидационныеКорректировкиГудвилл
	               |ГДЕ
	               |	бит_му_КонсолидационныеКорректировкиГудвилл.Ссылка = &Ссылка";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаГудвилл = РезультатЗапроса.Выгрузить();
	
	СтруктураТаблиц.Вставить("Гудвилл", ТаблицаГудвилл);
	
	// Табличная часть "Капитал"
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_му_КонсолидационныеКорректировкиКапитал.Организация,
	               |	бит_му_КонсолидационныеКорректировкиКапитал.Счет,
	               |	бит_му_КонсолидационныеКорректировкиКапитал.Сумма
	               |ИЗ
	               |	Документ.бит_му_КонсолидационныеКорректировки.Капитал КАК бит_му_КонсолидационныеКорректировкиКапитал
	               |ГДЕ
	               |	бит_му_КонсолидационныеКорректировкиКапитал.Ссылка = &Ссылка";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаКапитал = РезультатЗапроса.Выгрузить();
	
	СтруктураТаблиц.Вставить("Капитал", ТаблицаКапитал);
	
	Возврат СтруктураТаблиц;
	
КонецФункции // ПодготовитьТаблицыДокумента()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение созданного/скопированного документа.
// 
// Параметры:
//  ПараметрОбъектКопирования - ДокументОбъект.
// 
Процедура ПервоначальноеЗаполнениеДокумента(ПараметрОбъектКопирования = Неопределено)
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ПараметрОбъектКопирования);
												
	Если ПараметрОбъектКопирования <> Неопределено Тогда
		СоставНРП.Очистить();
		Капитал.Очистить();
	Иначе
		ОбъектСистемы = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнойРегистрБухгалтерииУУ);
	КонецЕсли;												
	
КонецПроцедуры // ПервоначальноеЗаполнениеДокумента()

// Процедура выполняет движения по регистрам.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураТаблиц 		- Структура.
//  СтруктураКурсыВалют 	- Структура.
//  Отказ 					- Булево.
//  Заголовок 				- Строка.
// 
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют, Отказ, Заголовок)
	
	ТаблицаДанных = СтруктураТаблиц.Гудвилл;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		// Сформируем проводки по табличной части "Гудвилл".
		СформироватьЗаписьГудвилл(СтруктураШапкиДокумента, СтрокаТаблицы, СтруктураКурсыВалют);
		
	КонецЦикла;
	
	ТаблицаДанных = СтруктураТаблиц.Капитал;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		// Сформируем проводки по табличной части "Капитал".
		СформироватьЗаписьКапитал(СтруктураШапкиДокумента, СтрокаТаблицы, СтруктураКурсыВалют);
		
	КонецЦикла;
	
	// Сформируем проводки по нераспределенной прибыли.
	СформироватьЗаписьНПР(СтруктураШапкиДокумента, СтруктураКурсыВалют);
	
КонецПроцедуры // ДвиженияПоРегистрам()

// Процедура формирует движение по строке табличной части "Гудвилл".
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтрокаТаблицы - Строка таблицы значений.
//  СтруктураКурсыВалют 	- Структура.
// 
Процедура СформироватьЗаписьГудвилл(СтруктураШапкиДокумента, СтрокаТаблицы, СтруктураКурсыВалют)
	
	// ДТ Счет Гудвилл КТ Счет вспомогательный, на сумму начала периода.
	Запись = Движения[ОбъектСистемы.ИмяОбъекта].Добавить();
	
	// Заполнение атрибутов записи.
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", СтруктураШапкиДокумента.Организация);
	СтруктураПараметров.Вставить("Период",      СтруктураШапкиДокумента.Дата);
	СтруктураПараметров.Вставить("Валюта",      СтруктураКурсыВалют["Упр"].Валюта);
	СтруктураПараметров.Вставить("СчетДт",      СтруктураШапкиДокумента.СчетГудвилла);
	СтруктураПараметров.Вставить("СчетКт",      СтруктураШапкиДокумента.СчетВспомогательный);
	СтруктураПараметров.Вставить("Сумма",       СтрокаТаблицы.НаДатуНачала);
	СтруктураПараметров.Вставить("Содержание",  СтруктураШапкиДокумента.Организация);
											 
	бит_му_ОбщегоНазначения.ЗаполнитьЗаписьРегистраМУ(Запись, СтруктураПараметров);											   
	Запись.СуммаУпр = СтрокаТаблицы.НаДатуНачала;
	
	// Выполним валютные пересчеты.
	ВыполнитьВалютныеПересчетыЗаписи(СтруктураПараметров, Запись, СтруктураКурсыВалют);
	
	// ДТ Счет списания обесценения Гудвилла КТ Счет Гудвилла, на разницу сумм на дату начала и дату окончания.
	Запись = Движения[ОбъектСистемы.ИмяОбъекта].Добавить();
	
	// Заполнение атрибутов записи.
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", СтруктураШапкиДокумента.Организация);
	СтруктураПараметров.Вставить("Период",      СтруктураШапкиДокумента.Дата);
	СтруктураПараметров.Вставить("Валюта",      СтруктураКурсыВалют["Упр"].Валюта);
	СтруктураПараметров.Вставить("СчетДт",      СтруктураШапкиДокумента.СчетВспомогательный);
	СтруктураПараметров.Вставить("СчетКт",      СтруктураШапкиДокумента.СчетСписанияОбесцененияГудвилла);
	СтруктураПараметров.Вставить("Сумма",       СтрокаТаблицы.НаДатуНачала - СтрокаТаблицы.НаДатуОкончания);
	СтруктураПараметров.Вставить("Содержание",  СтруктураШапкиДокумента.Организация);
											 
	бит_му_ОбщегоНазначения.ЗаполнитьЗаписьРегистраМУ(Запись, СтруктураПараметров);											   
	Запись.СуммаУпр = СтрокаТаблицы.НаДатуНачала - СтрокаТаблицы.НаДатуОкончания;
	
	// Выполним валютные пересчеты.
	ВыполнитьВалютныеПересчетыЗаписи(СтруктураПараметров, Запись, СтруктураКурсыВалют);
	
КонецПроцедуры

// Процедура формирует движение по строке табличной части "Капитал".
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтрокаТаблицы - Строка таблицы значений.
//  СтруктураКурсыВалют 	- Структура.
// 
Процедура СформироватьЗаписьКапитал(СтруктураШапкиДокумента, СтрокаТаблицы, СтруктураКурсыВалют)
	
	// Дт Счет вспомогательный Кт Счет капитала, сумма.
	Запись = Движения[ОбъектСистемы.ИмяОбъекта].Добавить();
	
	// Заполнение атрибутов записи.
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", СтруктураШапкиДокумента.Организация);
	СтруктураПараметров.Вставить("Период",      СтруктураШапкиДокумента.Дата);
	СтруктураПараметров.Вставить("Валюта",      СтруктураКурсыВалют["Упр"].Валюта);
	СтруктураПараметров.Вставить("СчетДт",      СтруктураШапкиДокумента.СчетВспомогательный);
	СтруктураПараметров.Вставить("СчетКт",      СтрокаТаблицы.Счет);
	СтруктураПараметров.Вставить("Сумма",       СтрокаТаблицы.Сумма);
	СтруктураПараметров.Вставить("Содержание",  СтруктураШапкиДокумента.Организация);
											 
	бит_му_ОбщегоНазначения.ЗаполнитьЗаписьРегистраМУ(Запись, СтруктураПараметров);											   
	Запись.СуммаУпр = СтрокаТаблицы.Сумма;
	
	// Выполним валютные пересчеты.
	ВыполнитьВалютныеПересчетыЗаписи(СтруктураПараметров, Запись, СтруктураКурсыВалют);
	
КонецПроцедуры

// Процедура формирует итоговое движение по нераспределенной прибыли.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураКурсыВалют 	- Структура.
// 
Процедура СформироватьЗаписьНПР(СтруктураШапкиДокумента, СтруктураКурсыВалют)
	
	// ДТ Счет вспомогательный КТ Основной счет НРП, на сумму НРП Итого.
	Запись = Движения[ОбъектСистемы.ИмяОбъекта].Добавить();
	
	// Заполнение атрибутов записи.
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", СтруктураШапкиДокумента.Организация);
	СтруктураПараметров.Вставить("Период",      СтруктураШапкиДокумента.Дата);
	СтруктураПараметров.Вставить("Валюта",      СтруктураКурсыВалют["Упр"].Валюта);
	СтруктураПараметров.Вставить("СчетДт",      СтруктураШапкиДокумента.СчетВспомогательный);
	СтруктураПараметров.Вставить("СчетКт",      СтруктураШапкиДокумента.ОсновнойСчетНПР);
	СтруктураПараметров.Вставить("Сумма",       СтруктураШапкиДокумента.СуммаНПРИтого);
	СтруктураПараметров.Вставить("Содержание",  СтруктураШапкиДокумента.Организация);
											 
	бит_му_ОбщегоНазначения.ЗаполнитьЗаписьРегистраМУ(Запись, СтруктураПараметров);											   
	Запись.СуммаУпр = СтруктураШапкиДокумента.СуммаНПРИтого;
	
	// Выполним валютные пересчеты.
	ВыполнитьВалютныеПересчетыЗаписи(СтруктураПараметров, Запись, СтруктураКурсыВалют);
	
КонецПроцедуры

// Функция определяет будут ли движения по международному учету.
// 
// Параметры:
//  Нет.
// 
// Возвращаемое значение:
//  Результат - Булево.
// 
Функция ЕстьМеждународныйУчет()

	Если Метаданные.РегистрыБухгалтерии[ОбъектСистемы.ИмяОбъекта].Ресурсы.Найти("СуммаМУ") = Неопределено Тогда
		ЕстьМеждународныйУчет = Ложь;
	Иначе
		ЕстьМеждународныйУчет = Истина;
	КонецЕсли;

	Возврат ЕстьМеждународныйУчет;
	
КонецФункции // ЕстьМеждународныйУчет()	

// Процедура выполняет расчет сумм "Регламентного и международного и управленческого учета".
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  Запись					- РегистрБухгалтерииЗапись.бит_Дополнительный.
//  СтруктураКурсыВалют 	- Структура.
// 
Процедура ВыполнитьВалютныеПересчетыЗаписи(СтруктураПараметров, Запись, СтруктураКурсыВалют)
	
	Запись.СуммаРегл = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(Запись.СуммаУпр,
																	СтруктураКурсыВалют["Упр"].Валюта, СтруктураКурсыВалют["Регл"].Валюта,
																	СтруктураКурсыВалют["Упр"].Курс, СтруктураКурсыВалют["Регл"].Курс,
																	СтруктураКурсыВалют["Упр"].Кратность, СтруктураКурсыВалют["Регл"].Кратность);
	Если ЕстьМеждународныйУчет() Тогда
		Запись.СуммаМУ = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(Запись.СуммаУпр,
																	СтруктураКурсыВалют["Упр"].Валюта, СтруктураКурсыВалют["МУ"].Валюта,
																	СтруктураКурсыВалют["Упр"].Курс, СтруктураКурсыВалют["МУ"].Курс,
																	СтруктураКурсыВалют["Упр"].Кратность, СтруктураКурсыВалют["МУ"].Кратность);
	КонецЕсли;																	
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
